```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_organization.random_string.random: Refreshing state... [id=si38]
data.external.git: Refreshing state... [id=-]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.deployer: Refreshing state... [id=1350816066]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.serverless_api["example"].module.aws_iam.aws_iam_user.user: Refreshing state... [id=serverless-example-api-deployer]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-18 04:57:14.320688994 +0000 UTC]
module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.cloudformation: Refreshing state... [id=3853530454]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.serverless_api["example"].module.aws_iam.aws_iam_role.cloudformation: Refreshing state... [id=serverless-example-api-cloudformation]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-18 04:57:14.357239653 +0000 UTC]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.assume_cloudformation_role: Refreshing state... [id=1006551700]
module.serverless_api["example"].module.aws_iam.aws_iam_role_policy.cloudformation_policy: Refreshing state... [id=serverless-example-api-cloudformation:base-policy]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.serverless_api["example"].module.aws_iam.aws_iam_access_key.access_key: Refreshing state... [id=AKIAZR4NNVR2AL4YQR66]
module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.policy: Refreshing state... [id=serverless-example-api-deployer:base-policy]
module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.assume_cloudformation_role: Refreshing state... [id=serverless-example-api-deployer:assume-cloudformation-role]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffoldly.dev]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-nonlive-access-logs]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-live-access-logs]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=b6ujqgrvd7]
module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffold.ly]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=m1oxmvsuek]
module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record: Refreshing state... [id=Z09185361UA62H9QOZ65H_api.scaffoldly.dev_A]
module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record: Refreshing state... [id=Z09171243VWGB0AD4XJAE_api.scaffold.ly_A]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health: Refreshing state... [id=q9m9iw]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-m1oxmvsuek-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health: Refreshing state... [id=vl6zab]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_b6ujqgrvd7/live]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_m1oxmvsuek/nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-b6ujqgrvd7-DEFAULT_4XX]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-m1oxmvsuek-q9m9iw-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-b6ujqgrvd7-vl6zab-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-m1oxmvsuek-q9m9iw-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-b6ujqgrvd7-vl6zab-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-m1oxmvsuek-q9m9iw-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-b6ujqgrvd7-vl6zab-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-b6ujqgrvd7-vl6zab-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-m1oxmvsuek-q9m9iw-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment: Refreshing state... [id=3ifrl3]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment: Refreshing state... [id=kubrjg]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-m1oxmvsuek-nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-b6ujqgrvd7-live]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffold.ly/example]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings: Refreshing state... [id=m1oxmvsuek-nonlive-*/*]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings: Refreshing state... [id=b6ujqgrvd7-live-*/*]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffoldly.dev/example]
module.serverless_api["example"].module.secrets["live"].data.aws_caller_identity.current: Refreshing state... [id=2020-09-18 04:57:17.802942801 +0000 UTC]
module.serverless_api["example"].module.secrets["nonlive"].data.aws_caller_identity.current: Refreshing state... [id=2020-09-18 04:57:17.802827701 +0000 UTC]
module.serverless_api["example"].module.secrets["live"].data.aws_partition.current: Refreshing state... [id=2020-09-18 04:57:17.774114911 +0000 UTC]
module.serverless_api["example"].module.secrets["nonlive"].data.aws_partition.current: Refreshing state... [id=2020-09-18 04:57:17.770093727 +0000 UTC]
module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_access_key: Refreshing state... [id=serverless-example-api:NONLIVE_AWS_ACCESS_KEY_ID]
module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_root_resource_id: Refreshing state... [id=serverless-example-api:NONLIVE_AWS_REST_API_ROOT_RESOURCE_ID]
module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_id: Refreshing state... [id=serverless-example-api:NONLIVE_AWS_REST_API_ID]
module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_root_resource_id: Refreshing state... [id=serverless-example-api:LIVE_AWS_REST_API_ROOT_RESOURCE_ID]
module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_access_key: Refreshing state... [id=serverless-example-api:LIVE_AWS_ACCESS_KEY_ID]
module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_id: Refreshing state... [id=serverless-example-api:LIVE_AWS_REST_API_ID]
module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_secret_key: Refreshing state... [id=serverless-example-api:LIVE_AWS_SECRET_ACCESS_KEY]
module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_secret_key: Refreshing state... [id=serverless-example-api:NONLIVE_AWS_SECRET_ACCESS_KEY]
module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_partition: Refreshing state... [id=serverless-example-api:NONLIVE_AWS_PARTITION]
module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_partition: Refreshing state... [id=serverless-example-api:LIVE_AWS_PARTITION]
module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_account_id: Refreshing state... [id=serverless-example-api:NONLIVE_AWS_ACCOUNT_ID]
module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_account_id: Refreshing state... [id=serverless-example-api:LIVE_AWS_ACCOUNT_ID]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.serverless_api["example"].module.stage["live"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      + id      = "3454387480"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/live-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "cloudwatch:PutMetricData",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "dynamodb:*Item*",
              + "dynamodb:Describe*",
              + "dynamodb:List*",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*",
            ]
        }
    }

  # module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-live"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role_policy.base will be created
  + resource "aws_iam_role_policy" "base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/live-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "serverless-example-api-live"
    }

  # module.serverless_api["example"].module.stage["nonlive"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      + id      = "704701628"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "cloudwatch:PutMetricData",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "dynamodb:*Item*",
              + "dynamodb:Describe*",
              + "dynamodb:List*",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*",
            ]
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-nonlive"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role_policy.base will be created
  + resource "aws_iam_role_policy" "base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "serverless-example-api-nonlive"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```